tap "mtn-man/tools"
tap "nikitabobko/tap"
tap "xykong/tap"
brew "bat"
brew "btop"
brew "coreutils"
brew "dua-cli"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "golangci-lint"
brew "jq"
brew "lazygit"
brew "lf"
brew "micro"
brew "ripgrep"
brew "rust-analyzer"
brew "rustup"
brew "stow"
brew "tailscale"
brew "tealdeer"
brew "transmission-cli"
brew "trash"
brew "unar"
brew "vhs"
brew "yt-dlp"
brew "zoxide"
brew "mtn-man/tools/after"
cask "nikitabobko/tap/aerospace"
cask "appcleaner"
cask "bitwarden"
cask "claude-code"
cask "xykong/tap/flux-markdown"
cask "font-monaspace"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "hammerspoon"
cask "handbrake-app"
cask "iina"
cask "kitty"
cask "linearmouse"
cask "raycast"
cask "spotify"
cask "steam"
cask "utm"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
