brew "bat"
brew "btop"
brew "delve"
brew "dua-cli"
brew "duti"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "git"
brew "go"
brew "golangci-lint"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "lf"
brew "mas"
brew "micro"
brew "ripgrep"
brew "rsync"
brew "stow"
brew "tealdeer"
brew "transmission-cli"
brew "trash"
brew "unar"
brew "yq"
brew "yt-dlp"
brew "zoxide"
cask "aldente"
cask "appcleaner"
cask "bitwarden"
cask "codex-app"
cask "font-fira-code"
cask "kitty"
cask "macdown-3000"
cask "raycast"
cask "tailscale-app"
mas "Developer", id: 640199958
mas "Folder Peek", id: 1615988943
mas "Hush", id: 1544743900
mas "Infuse", id: 1136220934
mas "NordVPN", id: 905953485
mas "uBlock Origin Lite", id: 6745342698
mas "Xcode", id: 497799835
go "golang.org/x/tools/gopls"
go "github.com/Mtn-Man/mintmedia/cmd/mintmedia"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/Mtn-Man/timer"
