tap "jurplel/tap", trusted: true
tap "mtn-man/tap", trusted: true
tap "nextdns/tap", trusted: true
tap "xykong/tap", trusted: true
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# GNU File, Shell, and Text utilities
brew "coreutils"
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Terminal file manager
brew "lf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Rust toolchain installer
brew "rustup"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Lightweight BitTorrent client
brew "transmission-cli"
# CLI tool that moves files or folder to the trash
brew "trash"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fast CLI countdown timer with live terminal feedback and optional alarms
brew "mtn-man/tap/after", trusted: true
# NextDNS DNS/53 to DoH Proxy
brew "nextdns/tap/nextdns", trusted: true
# Application uninstaller
cask "appcleaner"
# Desktop password and login vault
cask "bitwarden"
# Terminal-based AI coding assistant
cask "claude-code"
# Web browser
cask "firefox"
# Markdown previews in Finder QuickLook with diagrams and math
cask "xykong/tap/flux-markdown", trusted: true
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop automation application
cask "hammerspoon"
# Open-source video transcoder
cask "handbrake-app"
# Free and open-source media player
cask "iina"
# GPU-based terminal emulator
cask "kitty"
# Customise mouse behavior
cask "linearmouse"
# Control your tools with a few keystrokes
cask "raycast"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Mesh VPN based on WireGuard
cask "tailscale-app"
go "golang.org/x/tools/cmd/goimports"
go "golang.org/x/tools/gopls"
go "github.com/mtn-man/mintmedia/cmd/mintmedia"
